Revit 2024 API
BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEnd Property
 Unable to trim slanted column end geometry to desired condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SlantedColumnCannotCutEnd { get; }
Visual Basic
Public Shared ReadOnly Property SlantedColumnCannotCutEnd As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlantedColumnCannotCutEnd {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SlantedColumnFailures Class
Autodesk.Revit.DB Namespace